Revit 2027 API
RebarBendData.TerminationRotationAngle0 Property
 Identifies the termination's rotation angle (in radians) at the start. The default value is 0.0
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TerminationRotationAngle0 { get; set; }
Public Property TerminationRotationAngle0 As Double
	Get
	Set
public:
property double TerminationRotationAngle0 {
	double get ();
	void set (double value);
}
member TerminationRotationAngle0 : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for terminationRotationAngle0 is not finite
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace